blog/2013-10-05-linkfest.html

<!DOCTYPE HTML>
<html>
<head>
	<meta charset="utf-8">
	<title>Weekend Linkfest 5.10.2013 - Everything Counts</title>
	<meta name="author" content="Ronert Obst">

	
	<meta name="description" content="Statistics and Machine Learning The Art of Approximating Distributions: Histograms and Quantiles at Scale Building a Recommendation System in Python &hellip;">
	
	<meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1">

	<link href="/atom.xml" rel="alternate" title="Everything Counts" type="application/atom+xml">
	<link rel="canonical" href="">
	<link href="/favicon.png" rel="shortcut icon">
	<link href="/stylesheets/screen.css" media="screen, projection" rel="stylesheet" type="text/css">
	<!--[if lt IE 9]><![endif]-->
	<!--- MathJax Configuration -->

</head>

<body>
	<header id="header" class="inner"><h1><a href="/">Everything Counts</a></h1>
<nav id="main-nav"><ul class="main">
  <li><a href="/">Blog</a></li>
  <li><a href="/blog/archives">Archives</a></li>
  <li><a href="/about/">About</a></li>
</ul>
</nav>
<nav id="mobile-nav">
	<div class="alignleft menu">
		<a class="button">Menu</a>
		<div class="container"><ul class="main">
  <li><a href="/">Blog</a></li>
  <li><a href="/blog/archives">Archives</a></li>
  <li><a href="/about/">About</a></li>
</ul>
</div>
	</div>
	<div class="alignright search">
		<a class="button"></a>
		<div class="container">
			<form action="http://google.com/search" method="get">
				<input type="text" name="q" results="0">
				<input type="hidden" name="q" value="site:ronert-obst.com">
			</form>
		</div>
	</div>
</nav>
<nav id="sub-nav" class="alignright">
	<div class="social">
		
		
		<a class="google" href="https://plus.google.com/102717496982395822694?rel=author" title="Google+">Google+</a>
		
		
		<a class="twitter" href="http://twitter.com/ronert_obst" title="Twitter">Twitter</a>
		
		
		<a class="github" href="https://github.com/ronert" title="GitHub">GitHub</a>
		
    
		
		
		
		
		
		<a class="rss" href="/atom.xml" title="RSS">RSS</a>
		
	</div>
	<form class="search" action="http://google.com/search" method="get">
		<input class="alignright" type="text" name="q" results="0">
		<input type="hidden" name="q" value="site:ronert-obst.com">
	</form>
</nav>

</header>
	
		
	
	<div id="content" class="inner"><article class="post">
	<h2 class="title">Weekend Linkfest 5.10.2013</h2>
	<div class="entry-content"><div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">Statistics and Machine Learning</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li><a href="http://metamarkets.com/2013/histograms/">The Art of Approximating Distributions: Histograms and Quantiles at Scale</a>
</li>
<li><a href="http://nbviewer.ipython.org/20a18d52c539b87de2af?utm_source=Python+Weekly+Newsletter&utm_campaign=611942dc15-Python_Weekly_Issue_107_October_3_2013&utm_term=0_9e26887fc5-611942dc15-312687577&utm_content=bufferf61d0&utm_medium=twitter">Building a Recommendation System in Python</a>
</li>
<li><a href="http://gregable.com/2007/10/reservoir-sampling.html">Reservoir Sampling - Sampling from a stream of elements</a>
</li>
<li><a href="http://had00b.blogspot.de/2013/07/random-subset-in-mapreduce.html">Reservoir Sampling in MapReduce</a>
</li>
<li><a href="http://blog.gopivotal.com/p-o-v/3-examples-of-big-data-making-a-big-impact-on-healthcare-this-week?utm_source=rss&utm_medium=rss&utm_campaign=3-examples-of-big-data-making-a-big-impact-on-healthcare-this-week">3 Examples of Big Data Making a Big Impact on Healthcare This Week</a>
</li>
<li><a href="http://blog.visual.ly/graph-visualization-101/">Graph Visualization 101</a>
</li>
<li><a href="http://engineering.stanford.edu/news/stanford-algorithm-analyzes-sentence-sentiment-advances-machine-learning">Stanford Algorithm Analyzes Sentence Sentiment, Advances Machine Learning</a>
</li>
<li><a href="http://projecteuclid.org/DPubS?service=UI&version=1.0&verb=Display&handle=euclid.aoas/1380804802">Assessment of mortgage default risk via Bayesian state space models</a>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">R Package of the Week</h2>
<div class="outline-text-2" id="text-2">
<ul class="org-ul">
<li><a href="https://github.com/hadley/lineprof">lineprof: new profiling package by Hadley Wickham</a>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3">Paper of the Week</h2>
<div class="outline-text-2" id="text-3">
<ul class="org-ul">
<li><a href="http://arxiv.org/abs/1309.7821">Multiclass Bayesian Additive Classification Trees</a>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4">Programming</h2>
<div class="outline-text-2" id="text-4">
<ul class="org-ul">
<li><a href="https://github.com/erikfrey/bashreduce">bashreduce: mapreduce in a bash scriptxs</a>
</li>
<li><a href="http://cran.r-project.org/web/views/WebTechnologies.html">New CRAN Task View: Web Technologies and Services</a>
</li>
<li><a href="https://www.neckbeardrepublic.com/screencasts/pandas-vincent">Introduction to Pandas and Vincent</a>
</li>
<li><a href="https://github.com/piskvorky/gensim">gensim – Python Framework for Topic Modelling</a>
</li>
<li><a href="http://radimrehurek.com/2013/10/parallelizing-word2vec-in-python/">Parallelizing word2vec in Python</a>
</li>
<li><a href="http://engineering.linkedin.com/datafu/datafus-hourglass-incremental-data-processing-hadoop">DataFu&#8217;s Hourglass: Incremental Data Processing in Hadoop | LinkedIn Engineering</a>
</li>
<li><a href="http://www.postgresqlstudio.org/">PostgreSQL Studio</a>
</li>
<li><a href="http://jeremykun.com/2013/09/30/the-universal-properties-of-map-fold-and-filter/">The Universal Properties of Map, Fold, and Filter</a>
</li>
<li><a href="https://amplab.cs.berkeley.edu/benchmark/">Big Data Benchmark</a>
</li>
</ul>
</div>
</div>
</div>


<div class="meta">
	<div class="date">








  


<time datetime="2013-10-05T00:00:00+02:00" pubdate data-updated="true">Oct 5<span>th</span>, 2013</time></div>
	<div class="tags">


	<a class='category' href='/blog/categories/linkfest/'>Linkfest</a>


</div>
	
</div></article>

	<div class="share">
	<div class="addthis_toolbox addthis_default_style ">
	
	
	<a class="addthis_button_tweet"></a>
	
	
	<a class="addthis_button_google_plusone" g:plusone:size="medium"></a>
	
	<a class="addthis_counter addthis_pill_style"></a>
	</div>
  <script type="text/javascript" src="http://s7.addthis.com/js/250/addthis_widget.js#pubid="></script>
</div>


</div>
	<footer id="footer" class="inner">Copyright &copy; 2014

    Ronert Obst

– Proud member of <a href="http://www.r-bloggers.com">www.r-bloggers.com</a>
</footer>
	<script src="/javascripts/slash.js"></script>
<script src="/javascripts/jquery.fancybox.pack.js"></script>
<script type="text/javascript">
(function($){
	$('.fancybox').fancybox();
})(jQuery);
</script> <!-- Delete or comment this line to disable Fancybox -->


<script type="text/javascript">
      var disqus_shortname = 'everythingcounts';
      
        
        var disqus_script = 'count.js';
      
    (function () {
      var dsq = document.createElement('script'); dsq.type = 'text/javascript'; dsq.async = true;
      dsq.src = 'http://' + disqus_shortname + '.disqus.com/' + disqus_script;
      (document.getElementsByTagName('head')[0] || document.getElementsByTagName('body')[0]).appendChild(dsq);
    }());
</script>



	<script type="text/javascript">
		var _gaq = _gaq || [];
		_gaq.push(['_setAccount', 'UA-40781735-1']);
		_gaq.push(['_trackPageview']);

		(function() {
			var ga = document.createElement('script'); ga.type = 'text/javascript'; ga.async = true;
			ga.src = ('https:' == document.location.protocol ? 'https://ssl' : 'http://www') + '.google-analytics.com/ga.js';
			var s = document.getElementsByTagName('script')[0]; s.parentNode.insertBefore(ga, s);
		})();
	</script>



</body>
</html>